import math as mt
from scipy.integrate import quad
#Константы
R = 8.314
nu = 1
i = 3
P0 = 100000
V0 = 1
P1 = 43824.2
P2 = 92533.77
P3 = 5076.29
V1 = 1.54998
V2 = 2.52272
V3 = 2.98706
#Функции, ограничивающие цикл
def p1(v):
    return P0 * mt.log(v/V0)
def p2(v):
    return P0 - P0  * (v - 2 * V0)**4
def p3(v):
    return P0 * mt.exp(1.5 * (V0 - v))

#Находим температуры в переходных точках
T1 = (P1 * V1) / (nu*R)
T2 = (P2 * V2) / (nu*R)
T3 = (P3 * V3) / (nu*R)

#Находим работу по каждому процессу и суммарную работу
a12 = quad(p1, V1, V2)[0]
a23 = quad(p2, V2, V3)[0]
a31 = quad(p3, V3, V1)[0]
a = round(a12 + a23 + a31, 2)

#Находим изменение внутренней энергии по каждому процессу
u12 = i/2 * nu * R * (T2 - T1)
u23 = i/2 * nu * R * (T3 - T2)
u31 = i/2 * nu * R * (T1 - T3)

#Находим теплоту по каждому процессу, теплоту, полученную газом.
q12 = a12 + u12
q23 = a23 + u23
q31 = a31 + u31
Q = []
Q.extend((q12, q23, q31))
qr = 0
for i in range (len(Q)):
    if Q[i] > 0:
        qr = round(qr + Q[i], 2)
q = round(q12 + q23 + q31, 2)

#Находим КПД
ef = round(a/qr * 100, 2)

#Результаты
print('Работа, совершенная газом равна ' + str(a) + ' Дж')
print('Теплота, переданная газу в ходе цикла равна ' + str(qr) + ' Дж')
print('КПД цикла равен ' + str(ef) + ' %')